# Numeric

In [9]:
!pip install scikit-learn

Requirement already satisfied: scikit-learn in /opt/anaconda3/lib/python3.13/site-packages (1.6.1)
Requirement already satisfied: numpy>=1.19.5 in /opt/anaconda3/lib/python3.13/site-packages (from scikit-learn) (2.1.3)
Requirement already satisfied: scipy>=1.6.0 in /opt/anaconda3/lib/python3.13/site-packages (from scikit-learn) (1.15.3)
Requirement already satisfied: joblib>=1.2.0 in /opt/anaconda3/lib/python3.13/site-packages (from scikit-learn) (1.4.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in /opt/anaconda3/lib/python3.13/site-packages (from scikit-learn) (3.5.0)

In [57]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer
df = pd.read_csv("Datasets/Data.csv")

In [58]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2      NaN  30.0  54000.0       NaN
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

## Approach 1 : Removing the rows

In [59]:
df.dropna()

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

## 2. Filling the values - Using Imputers

In [60]:
# imputer = SimpleImputer(missing_values = np.nan , strategy = 'mean')

<!-- # perform slicing and consider only the required rows
df.iloc[:,1:3].values -->

In [61]:
# imputer.fit(df.iloc[:,1:3].values) # to calculate what to do

# x = imputer.transform(df.iloc[:,1:3].values) # this is the doing

In [62]:
# df.iloc[:,1:3] = x

In [63]:
# x

In [64]:
# df.iloc[:,1:3] = x

In [65]:
# df

In [66]:
# # All the steps together
# # 1. initialising the imputer 
# imputer = SimpleImputer(missing_values = np.nan , strategy = 'mean')

# # 2. filling the values
# imputer.fit(df.iloc[:,1:3].values) # to calculate what to do
# # 3. we transform it. use x as we want to transform x
# x = imputer.transform(df.iloc[:,1:3].values) # this is the doing

In [67]:
# df

## FIlling in with most frequent values
 ### 1. we tell the simple imputer how to handle missing values, what is to 
 ### be treated as a missing value and the strategy to follow

 ### 2. filling the values- the .fit looks at the selcted columns and   calculates the most frequent value . after this the imputer remembers these values

 ### 3. .transform() replaces nan with the remembered value from fit and we assign the values back to df.iloc[:,1:3] so that it is updted

In [68]:
#1.
imputer = SimpleImputer(missing_values = np.nan , strategy = 'most_frequent')
#2.
imputer.fit(df.iloc[:,1:3].values) # to calculate what to do
# 3.
df.iloc[:,1:3]= imputer.transform(df.iloc[:,1:3].values) # this is the doing

In [69]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2      NaN  30.0  54000.0       NaN
3    Spain  38.0  61000.0        No
4  Germany  40.0  48000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  27.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

## For categorial data

In [70]:
df.iloc[:,1:2]

    Age
0  44.0
1  27.0
2  30.0
3  38.0
4  40.0
5  35.0
6  27.0
7  48.0
8  50.0
9  37.0

In [71]:
#1.
imputer = SimpleImputer(missing_values = np.nan , strategy = 'most_frequent')
#2.
imputer.fit(df.iloc[:,3:].values) # to calculate what to do
# 3.
df.iloc[:,3:]= imputer.transform(df.iloc[:,3:].values) # this is the doing

In [72]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2      NaN  30.0  54000.0       Yes
3    Spain  38.0  61000.0        No
4  Germany  40.0  48000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  27.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

## When we have to perform this on a whole data frame

In [80]:
imputer = SimpleImputer(missing_values = np.nan , strategy = "most_frequent")
imputer.fit(df)

df = imputer.transform(df)

In [81]:
df

array([['France', 44.0, 72000.0, 'Yes'],
       ['Spain', 27.0, 48000.0, 'Yes'],
       ['France', 30.0, 54000.0, 'Yes'],
       ['Spain', 38.0, 61000.0, 'No'],
       ['Germany', 40.0, 48000.0, 'Yes'],
       ['France', 35.0, 58000.0, 'Yes'],
       ['Spain', 27.0, 52000.0, 'No'],
       ['France', 48.0, 79000.0, 'Yes'],
       ['Germany', 50.0, 83000.0, 'No'],
       ['France', 37.0, 67000.0, 'Yes']], dtype=object)